In [6]:
import pandas as pd
import mysql.connector
mydb=mysql.connector.connect(host="localhost",user="root",passwd="root",database="test")

In [2]:
mycursor=mydb.cursor()
mycursor.execute("show databases")

In [3]:
print(mycursor)
for i in mycursor:  # get all the database name 
    print(i)

CMySQLCursor: show databases
('information_schema',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('test',)
('world',)

In [9]:
df=pd.read_sql("select * from student",mydb).head()

In [10]:
df

    id   name college
0  101  vijay  BSACET
1  101   amit      DU
2  101  vijay  BSACET
3  102   amit      DU
4  103   amit      DU

In [17]:
df=pd.read_sql("select * from student",mydb,index_col=['name']).head(3)

In [18]:
df

        id college
name
vijay  101  BSACET
amit   101      DU
vijay  101  BSACET